# IsAHanger Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..IsAHanger Method
FabricationPart Class See Also
---
Checks whether it is a hanger.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsAHanger()
```

Visual Basic
---
```text
Public Function IsAHanger As Boolean
```

Visual C++
---
```text
public:
bool IsAHanger()
```

# ### Return Value
True if the part is a hanger. False otherwise.
# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace